---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidRoofCurveloopFailure
source: html/59baaaf3-516b-eb43-50d8-64eccda99678.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidRoofCurveloopFailure Property

Base sketch for roof is invalid

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidRoofCurveloopFailure { get; }
```